---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.Pipe
zh: 管道、水管、管线
source: html/556c51c6-7db8-9519-ea60-57d70a1372df.htm
---
# Pipe Methods

**中文**: 管道、水管、管线

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.